print("Привіт! Я бот. Щоб закінчити розмову, скажіть 'пока'.")

while True:
    user_input = input("Введіть ваше повідомлення: ")
    user_input = user_input.lower()

    if user_input.find("привіт") != -1:
        print("Привіт! Як у вас справи?")
    elif user_input.find("я добре") != -1:
        print("Це чудово! Чим я можу вам допомогти?")
    elif user_input.find("що ти вмієш робити?") != -1:
        print("Я можу відповідати на ваші запитання і надати інформацію. Просто запитайте!")
    elif user_input.find("як тебе звати?") != -1:
        print("Мене звуть Бот. Дуже приємно з вами спілкуватись!")
    elif user_input == "пока":
        print("До зустрічі! Бувайте!")
        break
    else:
        print("Вибачте, я не розумію вашого повідомлення. Спробуйте ще раз.")

